In [121]:
import aquire
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

# IRIS

In [122]:
df = aquire.get_iris_data()

In [123]:
df = df.drop(['species_id','measurement_id'], axis=1)

In [124]:
df = df.rename(index=str, columns={"species_name": "species"})

Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [125]:
encoder = LabelEncoder()
encoder.fit(df.sepal_length)

LabelEncoder()

In [126]:
df.sepal_length = encoder.transform(df.sepal_length)

In [127]:
df.sepal_length.head()

0    8
1    6
2    4
3    3
4    7
Name: sepal_length, dtype: int64

In [128]:
def prep_iris (df):
    encoder = LabelEncoder()
    encoder.fit(df.sepal_length)
    return df.assign(sepal_length=encoder.transform(df.sepal_length))

In [129]:
prep_iris(df).head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa             8          3.5           1.4          0.2
1  setosa             6          3.0           1.4          0.2
2  setosa             4          3.2           1.3          0.2
3  setosa             3          3.1           1.5          0.2
4  setosa             7          3.6           1.4          0.2

# Titanic

In [130]:
tdf = aquire.get_titanic_data()

In [131]:
tdf.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [132]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [133]:
tdf.shape

(891, 13)

In [134]:
tdf.sample()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
526,526,1,2,female,50.0,0,0,10.5,S,Second,None,Southampton,1

In [135]:
tdf.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [136]:
tdf.select_dtypes('object').head()

      sex embarked  class  deck  embark_town
0    male        S  Third  None  Southampton
1  female        C  First     C    Cherbourg
2  female        S  Third  None  Southampton
3  female        S  First     C  Southampton
4    male        S  Third  None  Southampton

In [137]:
tdf.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [138]:
tdf = tdf.drop(['deck'], axis=1)

In [139]:
tdf.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

In [140]:
tdf.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
embark_town       2
alone             0
dtype: int64

In [141]:
tdf.age.value_counts(dropna=False)

NaN       177
 24.00     30
 22.00     27
 18.00     26
 28.00     25
 19.00     25
 30.00     25
 21.00     24
 25.00     23
 36.00     22
 29.00     20
 32.00     18
 26.00     18
 35.00     18
 27.00     18
 16.00     17
 31.00     17
 34.00     15
 23.00     15
 33.00     15
 20.00     15
 39.00     14
 17.00     13
 42.00     13
 40.00     13
 45.00     12
 38.00     11
 50.00     10
 2.00      10
 4.00      10
         ...
 28.50      2
 63.00      2
 0.83       2
 30.50      2
 70.00      2
 57.00      2
 0.75       2
 13.00      2
 59.00      2
 10.00      2
 64.00      2
 40.50      2
 45.50      2
 32.50      2
 20.50      1
 24.50      1
 0.67       1
 70.50      1
 0.92       1
 74.00      1
 34.50      1
 14.50      1
 80.00      1
 12.00      1
 53.00      1
 36.50      1
 55.50      1
 66.00      1
 23.50      1
 0.42       1
Name: age, Length: 89, dtype: int64

In [142]:
tdf.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

In [143]:
tdf.embark_town.value_counts(dropna=False)

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [144]:
tdf.embark_town.fillna('Other',inplace=True)

In [145]:
tdf.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Other            2
Name: embark_town, dtype: int64

In [146]:
tdf.embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

In [147]:
tdf.embarked.fillna('O',inplace=True)

In [148]:
tdf.embarked.value_counts()

S    644
C    168
Q     77
O      2
Name: embarked, dtype: int64

In [149]:
def encode_titanic (tdf):
    encoder = LabelEncoder()
    encoder.fit(tdf.embarked)
    return tdf.assign(embarked=encoder.transform(tdf.embarked))

In [150]:
encode_titanic(tdf).head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,3,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,0,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,3,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,3,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,3,Third,Southampton,1

Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [151]:
# train, test = train_test_split(tdf)

In [152]:
#fing the parameteres for scaling from the training data set, then apply to the data set

# fare_min = train.fare.min()
# fare_max = train.fare.max()

# #scale the training data
# train.fare = (train.fare - fare_min)/(fare_max - fare_min)

# #scale the test data
# test.fare = (test.fare -fare_min)/(fare_max -fare_min)

In [153]:
# #fing the parameteres for scaling from the training data set, then apply to the data set

# age_min = train.age.min()
# age_max = train.age.max()

# #scale the training data
# train.age = (train.age - age_min)/(age_max - age_min)

# #scale the test data
# test.age = (test.age - age_min)/(age_max - age_min)

In [154]:
# def train_test_split (tdf):
#     train, test = train_test_split(tdf)
#     return df

# def scaler (tdf):
#     scaler = MinMaxScaler()
#     scaler.fit(train[['fare','age']])
#     return tdf

# def transform (tdf):
#     train[['fare','age']] = scaler.transform(train[['fare','age']])
#     test[['fare','age']] = scaler.transform(test[['fare','age']])
#     return tdf

# def tts_scaler_transform(tdf):
# #     df = handle_missing_values(tdf)
# #     df = drop_columns(tdf)
# #     df = encode_embarked(tdf)
# #     return df
# #     return encode_embarked(drop_columns(handle_missing_values(tdf)))
#     return tdf.pipe(train_test_split)\
#         .pipe(scaler)\
#         .pipe(transform)

# tts_scaler_transform(tdf)



train, test = train_test_split(tdf)

scaler = MinMaxScaler()
scaler.fit(train[['fare','age']])

train[['fare','age']] = scaler.transform(train[['fare','age']])
test[['fare','age']] = scaler.transform(test[['fare','age']])


# def tts_scaler_transform(tdf):
# #     df = handle_missing_values(tdf)
# #     df = drop_columns(tdf)
# #     df = encode_embarked(tdf)
# #     return df
# #     return encode_embarked(drop_columns(handle_missing_values(tdf)))
#     return tdf.pipe(train_test_split)\
#         .pipe(scaler)\
#         .pipe(transform)

# tts_scaler_transform(tdf)

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:34: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s
/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:35: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [155]:
from aquire import get_titanic_data

prep_titanic_data(get_titanic_data()).head()

NameError: name 'prep_titanic_data' is not defined